{"evaluation": {"clarity": "2", "comprehension": "1", "comments": "You mentioned the fear of destruction which costs much for re-building. The fear made you not to build too many buildings in the game. To pursue development, you had to be confident by managing the risk properly.  The strength of your reflection is that you clearly expressed the dilemma of further development and the fear of destruction.\n\nOne thing that I would like to mention is that there were little description of the difference between knowledge, protection, and insurance.  Those three actions have different roles and the cost for them are different.  It would be much better if you describe the difference between each of them and how they should be combined.", "reflection": "2"}, "reflection": "At first, as I will discuss later, I found that I was too afraid to build too many buildings, as the fear of re-building and the costs associated with this were more than I could outlay.  However, I realised that the psychology behind my fear and unwillingness to develop was crippling for the community and my ability to advance in the game.  I can see that this would be a very real dilemna for communities around the world and contributes to the high levels of destruction and disrepair after natural disaster and other disasters.  After some time in the game I realised that building enhanced the community’s resources and was necessary for development.  Risk management for me took the form of reluctance at first and then, after 3 attempts at the game, knowledge enhancement and insurance helped to increase development which in turn enhanced resources and the ability of the community to cope.  This knowledge and insurance increased my risk-taking and provided more confidence in the community’s ability to withstand the impacts of the comets, should they hit.  The power of knowledge and the positive impacts of protection and insurance enabled me to feel confident in developing the community and in their ability to work together and cope.  "}